cf_billing/Reports/бестПочасовоеПотребление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бестПочасовоеПотребление</Name>
		</Properties>
	</Report>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестПочасовойОбъемНачисленийЭлектроэнергии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестПочасовойОбъемНачисленийЭлектроэнергии</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСредневзвешенная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСредневзвешеннаяНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтклонениеОтПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыЦенНаЭЭ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>День</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Час</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/Enums/бестТипыЦенНаЭЭ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестТипыЦенНаЭЭ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФактическоеЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПревышениеНадФактом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПревышениеНадПланом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Reports/бестПочасовоеПотребление/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Задает расширенные настройки отчетов конфигурации.
//
// Параметры:
//	 Настройки - ТаблицаЗначений - коллекция предопределенных вариантов отчетов
//	 НастройкиОтчета - Структура
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет по судебной работе'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СформироватьОтчет(ТабДок, ПараметрыОтчета) Экспорт
	
	ТабДок.Очистить();
	
	
	Макет	= ПолучитьМакет("Макет");
	
	ОбластьШапка					= Макет.ПолучитьОбласть("Шапка");
	
	ТабДок.Вывести(ОбластьШапка);
	
	РезультатЗапроса = ПолучитьДанныеПочасовогоПотребления(ПараметрыОтчета);
	
	ВыборкаДень = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДень.Следующий() Цикл
		
		ОбластьДанные					= Макет.ПолучитьОбласть("Данные");
		ОбластьДанные.Параметры.День 	= Формат(ВыборкаДень.День,"ДФ=dd.MM.yyyy");
		
		ВыборкаДетальныеЗаписи = ВыборкаДень.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.ОтклонениеОтПлана = Перечисления.бестТипыЦенНаЭЭ.ПревышениеНадПланом Тогда
				ПостФикс = "П";
			ИначеЕсли ВыборкаДетальныеЗаписи.ОтклонениеОтПлана = Перечисления.бестТипыЦенНаЭЭ.ПревышениеНадФактом Тогда
				ПостФикс = "Ф";
			Иначе 
				ПостФикс = "";
			КонецЕсли;
			ОбластьДанные.Параметры["Объем" + ПостФикс + ВыборкаДетальныеЗаписи.Час] = ВыборкаДетальныеЗаписи.ОбъемУслуги;
			ОбластьДанные.Параметры["Сумма" + ПостФикс + ВыборкаДетальныеЗаписи.Час] = ВыборкаДетальныеЗаписи.СуммаСредневзвешенная;
			ОбластьДанные.Параметры["НерегЦена" + ПостФикс + ВыборкаДетальныеЗаписи.Час] = ВыборкаДетальныеЗаписи.ЗначениеТарифа;
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьДанные);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеПочасовогоПотребления(ПараметрыОтчета)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестПочасовойОбъемНачисленийЭлектроэнергии.День КАК День,
		|	бестПочасовойОбъемНачисленийЭлектроэнергии.Час КАК Час,
		|	СУММА(бестПочасовойОбъемНачисленийЭлектроэнергии.ОбъемУслуги) КАК ОбъемУслуги,
		|	СУММА(бестПочасовойОбъемНачисленийЭлектроэнергии.СуммаСредневзвешенная) КАК СуммаСредневзвешенная,
		|	бестПочасовойОбъемНачисленийЭлектроэнергии.ОтклонениеОтПлана КАК ОтклонениеОтПлана,
		|	бестПочасовойОбъемНачисленийЭлектроэнергии.ЗначениеТарифа КАК ЗначениеТарифа
		|ИЗ
		|	РегистрНакопления.бестПочасовойОбъемНачисленийЭлектроэнергии КАК бестПочасовойОбъемНачисленийЭлектроэнергии
		|ГДЕ
		|	бестПочасовойОбъемНачисленийЭлектроэнергии.Организация = &Организация
		|	И бестПочасовойОбъемНачисленийЭлектроэнергии.Район = &Район
		|	И бестПочасовойОбъемНачисленийЭлектроэнергии.ПериодНачисления = &ПериодНачисления
		|	И бестПочасовойОбъемНачисленийЭлектроэнергии.ОбъектРасчета = &ОбъектРасчета
		|	И бестПочасовойОбъемНачисленийЭлектроэнергии.Услуга = &Услуга
		|
		|СГРУППИРОВАТЬ ПО
		|	бестПочасовойОбъемНачисленийЭлектроэнергии.День,
		|	бестПочасовойОбъемНачисленийЭлектроэнергии.Час,
		|	бестПочасовойОбъемНачисленийЭлектроэнергии.ОтклонениеОтПлана,
		|	бестПочасовойОбъемНачисленийЭлектроэнергии.ЗначениеТарифа
		|ИТОГИ ПО
		|	День";
	
	Запрос.УстановитьПараметр("ОбъектРасчета", 		ПараметрыОтчета.ОбъектРасчета);
	Запрос.УстановитьПараметр("Организация", 		ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПараметрыОтчета.ПериодНачисления);
	Запрос.УстановитьПараметр("Район", 				ПараметрыОтчета.Район);
	Запрос.УстановитьПараметр("Услуга", 			ПараметрыОтчета.Услуга);
	
	Возврат Запрос.Выполнить();
	
КонецФункции 

#КонецОбласти

#КонецЕсли
